rottenpotatoes/app/controllers/movies_controller.rb

  def create
    @movie = Movie.create!(movie_params)
---
INSERT INTO "movies" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2016-03-18 22:51:30.512512"], ["updated_at", "2016-03-18 22:51:30.512512"]]

  def same_director
    @movie = Movie.find params[:id]
    if @movie.director.nil? || @movie.director.empty?
---
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 0]]
SELECT "movies".* FROM "movies" WHERE "movies"."director" = ?  [["director", "George Lucas"]]